Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage
Since:
2024
The ways in which an ExternallyTaggedNonBRep can be used in Revit.
Since:
2024

Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage.Referenceable
Can be dimensioned to as well as snapped to.

Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage.Snappable
Can be snapped to as well as selected.

Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage.Selectable
Can be selected as well as displayed.

Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage.Displayable
Can be used for display purposes.